from aiogram import Router, F
from aiogram.types import CallbackQuery

from shop.it.keyboard_shop.inline_shop import inline_start_shop, inline_it_shop_return

shop_router = Router()

@shop_router.callback_query(F.data == 'shop_start')
async def cmd_unlocks(callback: CallbackQuery):
	await callback.message.delete()
	await callback.message.answer('🔥 Асортимент 🔥', reply_markup=inline_start_shop)

@shop_router.callback_query(F.data == 'shop')
async def cmd_unlocks(callback: CallbackQuery):
	await callback.message.edit_text('🔥 Асортимент 🔥', reply_markup=inline_start_shop)

@shop_router.callback_query(F.data == 'tg_bot_info')
async def cmd_tg_bot_info(callback: CallbackQuery):
	await callback.message.edit_text('⚡️ <b>Чат-боти для Telegram</b> ⚡️\nСтворення ботів, які можуть відповідати '
	                                 'на запитання користувачів, надавати інформацію, виконувати команди та автоматизувати '
	                                 'рутинні завдання\n 2️⃣0️⃣➖1️⃣5️⃣0️⃣💲\n\n'
	                                 '💻 <b>Розробка ботів для бізнесу</b> 💻\nСтворення інструментів для '
	                                 'керування замовленнями, клієнтами або внутрішніми процесами \n3️⃣9️⃣➖3️⃣9️⃣9️⃣💲\n\n'
	                                 '🎮 <b>Ігровий бот</b> 🎮\nСтворення бота, який здатний проводити різні ігри та цікаві події у '
	                                 'вашому чаті. Наприклад, гра в мафію може урізноманітнити вашу бесіду 🎭 \n2️⃣9️⃣➖1️⃣9️⃣9️⃣💲\n\n'
	                                 '💳 <b>Бізнес-бот</b> 💳 \nПовноцінний автоматизований бот, який презентуватиме ваші продукти, '
	                                 'навчальні курси та різні інші товари з можливістю приймати оплату як за 🌟, '
	                                 'так і кріптою 📌\n6️⃣9️⃣➖5️⃣9️⃣9️⃣💲\n\n'
	                                 'Можлива розробка індивідуального бота 🔑\n'
	                                 'Ціна залежить від функціоналу та інтеграцій 💲\n'
	                                 'За деталями писати сюди: @ShadowCryps', parse_mode='HTML' , reply_markup=inline_it_shop_return)

@shop_router.callback_query(F.data == 'ds_bot_info')
async def cmd_ds_bot_info(callback: CallbackQuery):
	await callback.message.edit_text("🔨 <b>Бот модерації</b> 🔨\nВаш сервер – ваші правила! Цей бот миттєво "
	                                 "розправиться зі спамерами, токсичними гравцями☢️ та порушниками, видаючи мут, бан чи "
	                                 "попередження, поки ви спокійно насолоджуєтесь спілкуванням\n2️⃣5️⃣➖9️⃣9️⃣💲 \n\n"
	                                 "📀 <b>Музичний бот</b> 📀\nПеретворіть свій сервер на дискотеку! 🌐 Відтворюйте "
	                                 "улюблені треки з YouTube, Spotify та інших платформ, створюйте плейлисти та "
	                                 "насолоджуйтесь музикою\n2️⃣9️⃣➖5️⃣9️⃣💲 \n\n"
	                                 "🎮 <b>Ігровий бот</b> 🎮 \nНудно? Не проблема! Цей бот додасть веселощів на ваш "
	                                 "сервер: вікторини, мафія, рулетка з дошкою топів, де кожен може змагатися за звання "
	                                 "найкращого гравця 🚀\n 3️⃣4️⃣➖9️⃣9️⃣💲\n\n"
	                                 "🌍 <b>Інтеграція з соцмережами</b> 🌍\nБільше ніяких пропущених новин! Бот "
	                                 "автоматично повідомлятиме про нові відео, стріми чи твіти, щоб ваша спільнота "
	                                 "завжди була в курсі подій першою 📣\n1️⃣9️⃣➖3️⃣9️⃣💲"
	                                 "\n\nЦіна залежить від функцій — ми підлаштуємось "
	                                 "під ваші потреби! \n☎️ Зв'язок: @ShadowCryps",
	                                 reply_markup=inline_it_shop_return, parse_mode='HTML')

@shop_router.callback_query(F.data == 'sites_info')
async def cmd_sites_info(callback: CallbackQuery):
	await callback.message.edit_text('📜 <b>Створення лендінгів</b> 📜\n5️⃣0️⃣➖1️⃣9️⃣9️⃣💲\n\n'
	                                 '🏷️ <b>Розробка багатосторінкових сайтів</b> 🏷️ \nРозробка сучасних сайтів, що '
	                                 'поєднують стильний дизайн, зручну навігацію та інтеграцію з базами даних ⚙️\n'
	                                 '2️⃣0️⃣0️⃣➖9️⃣9️⃣9️⃣💲\n\n'
	                                 '📱 <b>Мобільна адаптація</b> 📱\nАдаптація дизайну під різні екрани та забезпечення '
	                                 'коректної роботи функціоналу на всіх пристроях включає додаткову плату. Це гарантує, '
	                                 'що ваш сайт виглядатиме і працюватиме бездоганно на смартфонах та планшетах ✅\n'
	                                 '1️⃣9️⃣➖4️⃣9️⃣💲\n\n'
	                                 '🔎 <b>Веб-скрапінг та аналіз даних</b> 🔎\nВитяг даних із різних джерел, таких '
	                                 'як сайти чи онлайн-каталоги, для аналізу та різних потреб, наприклад, моніторингу '
	                                 'цін або трендів 📊\n'
	                                 '🔟➖2️⃣9️⃣💲\n\n\n🛠️ Функціонал обговорюємо детально на етапі розробки: @ShadowCryps',
	                                 parse_mode='HTML', reply_markup=inline_it_shop_return)